Tekla Open API Reference for Tekla Structures 2025
IEvents.DrawingStatusChanged Event
 The DrawingStatusChanged event is raised when the drawing status has changed.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.DrawingStatusChangedDelegate DrawingStatusChanged
Event DrawingStatusChanged As Events.DrawingStatusChangedDelegate
Value
Type: Tekla.Structures.Drawing.Events.DrawingStatusChangedDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Drawing Namespace